[{"author":"soulghost","story":"This sad life is coming to an end, the street seem far from up here and only one step separates me from freedom but I can only think on how it began..."},{"author":"gaguevaras","story":"There are very few real rangers left. Most of them roam the galaxy looking for easy jobs in dingy bars, hanging out with shady characters. Honor is useless, the guilds are gone. It's every man for himself and the body counts are testament to that. Lawlessness rules what once was a thriving civilization, composed by thousands of planets. Edgardian sometimes ponders his old life as a ranger and is caught by nostalgia as he is now, having a beer, reminiscing."},{"author":"edgardian","story":" -\"tough day uh?\"- said the man sitting next to him in the bar.\n -\"All of them are tough when you are a dwarf man, but my girl help me get trough this every day\"- said edgardian while he clean his plasma rifle. -\"At the end is just about surviving till you get your next beer\"\n-\"Aye for that!!\"-said the man and then he took a drink  of his beer, after a imposibly long gulp he stares at edgarian and then he said \n-\"Name is Slash, what brings you here young Dwarf?\"-"},{"author":"slash","story":"\"I came here looking for riches... alas, my ship crashed and I have been stranded here for 30 years, hoping to get enough funds to rebuild it and scramble... I grow older, but I still don't give up\". Edgardian couldn't stop looking to the table behind his new \"friend\", the captain of the Frog army, his target, was just there... surrounded by his elite guard. One quick shot and some distraction allowing him escaping is all he needed to claim his reward and get the hell out of Aurora Vitae, the cursed purple planet."},{"author":"deekattax","story":" A small Frog grunt, not much taller than Edgardian himself, gazed at a tiny glowing rod protruding from the sheath tied to his left boot. With a subtle tilt of his head, and a weird snap of is webbed middle fingers, he summoned a pair of larger thugs, who materialized from the back dark corner, and sat down at the only two available bunks next to them at the bar. The midget grunt stood behind them, menacing and mumbling curses in street gnarkish."},{"author":"mrthomas","story":" Edgardian decided it was simply not worth it. Taking out the disgusting frog would be easy, but escaping would not be. As he paid his drink and nodded goodbye to Slash, he knew there would be no leaving this place peacefully. One of the guards was walking towards him and would be right behind him in a matter of seconds. He had to act. As he turned he grabbed the guards arm as it was stretching to grab him, the guard's last expression one of surprise as he was knocked out by a well delivered right hook to the jaw. Without stopping, moved over towards the captain and locked his neck tight. Facing the other guard, who had already pulled out his phaser, he said: \"Drop it.\""},{"author":"suvreial","story":" while holding a knife next to the captain's heart. But frog army guards do not eat up these kind of threats and was about to pull the trigger when suddenly all Edgardian could see was how the guard disintegrated into dust in front of his eyes and behind him was Slash with his gun drawn. "},{"author":"suvreial","story":" -\"Talk about good timing, heh?\" said Edgardian, -\"Oh, no, don't thank me yet my friend\" said Slash while turning into a dust cloud, he quickly appeared beside Edgardian, stunned him with the back of his gun while a smoggy creature that came out of his bag wrapped itself around the captain, after that he said \"Goodbye friends, and thanks for everything\" and turned once more into a dust cloud and they both disappeared."},{"author":"zurdus","story":" The stench of decades of rot and the blinding pain in the back of his head welcomed Edgardian as he woke from his slumber. _\"Where the hell...\"_ he began to say when it all came back to him. \"That STINKING RAT!! SLASH!! Let me out of here, you Brigga scum!!\" "},{"author":"zurdus","story":" His desperate screams only reached the walls' ears."},{"author":"zurdus","story":"Edgardian screamed until his voice became a whisper. His heart pumping with uncontrollable rage, he decided to comb the walls for any signs of an entrance. The rounded cell was surrounded by walls as tall as the eye could see. A typical Brigga cell, devised to bring men to insanity. Knowing these structures, he would run out of oxygen really soon. He might as well spend his last hours in peace..."},{"author":"zurdus","story":"As Edgardian prepared to face the Darkness once more, something caught his eye: A faint glimmer he hadn't noticed before... could it be? He reached for it and grabbed it in his hands. The gods were merciful; an Astlari ring!"},{"author":"zurdus","story":"Saying a silent prayers to the Ancient, who never left his side, he wore the ring and waited. But as soon as he slid it through his finger, he knew he'd spoke to soon..."},{"author":"zurdus","story":"\"This...impossible!\" He managed to say as the figure emerged from the shadows of the dungeon."},{"author":"mrthomas","story":" He had used that ring before. It was a clever contraption he used during the war, to generate holograms across hard surfaces. It was a very valuable item and he wondered why whoever had put him in this dark cell left it in his pocket. Maybe someone did not want him there. There was no time for that though, air was running low and he had to figure out a way to get out. The shadows were given shape and as he crafted a clever deception for the guard outside, showing a hologram of him opening the door and running away. When the guard came after him and found nothing, he checked the cell. Edgardian was prepared to overpower him, it was an easy job. As he was removing the last piece of armor from the guard, there was one thing on his mind. Slash."},{"author":"mrthomas","story":" He had used that ring before. It was a clever contraption he used during the war, to generate holograms across hard surfaces. It was a very valuable item and he wondered why whoever had put him in this dark cell left it in his pocket. Maybe someone did not want him there. There was no time for that though, air was running low and he had to figure out a way to get out."},{"author":"mrthomas","story":" The shadows were given shape and as he crafted a clever deception for the guard outside, showing a hologram of him opening the door and running away. When the guard came after him and found nothing, he checked the cell. Edgardian was prepared to overpower him, it was an easy job. As he was removing the last piece of armor from the guard, there was one thing on his mind. Slash."},{"author":"slash","story":" Another full 2 years seem to have passed... Edgardian has almost lost all sense of time. A small cross shaped window staring dead into a featureless purple mountain is all contact he has with the exterior world. About one time per week, three tiny capsules drop from a hole in the ceiling... just enough for his body to survive. He recalled the day one year ago: a horse-like creature passed slowly through the mountain, eating those stupid shaped cyan fruits that were everywhere in this god damn planet.  \"Why are you keeping me alive!\" - Edgardian dared shout again, not really expecting a response... but this time he could heard a voice other than his own...."},{"author":"mrthomas","story":" After a long time at the dungeon, Edgardian was nearing a breakdown. He was about to lose his mind. His failed escape attempt on his very first day as a prisoner had been followed by terrible torture, both physical and psychological. His ring taken away by the overwhelming amount of guards that took over him as he tried to escape. Edgardian was a wretch of a man, once a valued military asset, now a forsaken prisoner. He had not been idle the whole time though. His mind had not failed him. He had taken care to dig a little every day, after finding a loose rock on the floor. Hiding the dirt on his waste bucket and finding hope in his future escape. The tunnel was almost complete."},{"author":"deekattax","story":" (Two years earlier, Space Port's Gnark Tavern) The Grunt raised the crystal to test for its purity against the dim entrance light. \n- \"You'd better hide that thing!\" - said the midget, still a bit shaken and aching after Edgardian's hook in his jaw. - \"Master Commander won't forgive any other lost stone!! And I surely don't wanna end up like Wazder, remember?\"\n - \"Don't be a fool, Wazder was getting too fat too fast, even a dumb greedy bastard as the commander could have noticed. Besides, we are now collecting our bounty in advance, not waiting until he finally seizes full control of this part of the galaxy -which we know is unlikely to happen\"\n - \"You're playing with fire here, and I want no part in it. I'll tell...\"\n -\"Master!\" - As Commander himself reappeared, after taking away Edgardian in a surprise move, the two standing frogs were startled."}]
